{
    "session_id": 140,
    "title": "Thinking Spatially: How location intelligence can enhance your data and let you uncover new insights.",
    "views": 16,
    "total_favs": 33,
    "fav_count": 35,
    "unfav_count": 2,
    "session_notes": 3,
    "space": "Open science",
    "pathway": "",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-thinking-spatially--how-location-inte",
    "notes": "Welcome to Etherpad!\n\nThis pad text is synchronized as you type, so that everyone viewing this page sees the same text. This allows you to collaborate seamlessly on documents!\n\nGet involved with Etherpad at http://etherpad.org\n\nStuart from Carto. We're a company based in New YOrk and Madrid. We build entirely in open source.\n\nhttps://github.com/CartoDB\n\nI'd like to talk about getting into the special mindset.\n\nThe maps his company makes:\n\nHe shows a map of the US population, the colours show enthnicity.\n\nData is plural < a data magazine you can subscribe to.\n\nHe shows a map with the median rent across the US. Cartography style.\n\nHe wants to talk about how we make maps. How we can use more powerful tools like statistics. \n\nHow can a map go wrong?\n\nThey become population maps. They just show where people are, they don't really tell you anything. \n\nHe shows this: https://www.explainxkcd.com/wiki/index.php/1138:_Heatmap\n\nShowing how things change over time is difficult in maps.\n\nAll maps are biased.\n\nImagine a simple map of America. Imagine colouring the map by transport option. Public transit is red, car is blue. What colour will the map be? It would mostly be blue. BUt if you tracked that as a bar chart, It's mostly red. There are very few people in rural areas, but they show up the most on a map, rather that a city which natrually takes up less space.\n\nHe's getting the data set for UFO sightings around America. Let's see how we can visualise that data.\n\nIt's a database like any other. Importantly it has a geometry column. This is open data. There's also a bigfoot sightings dataset you could use for the same example(!).\n\nHe shows a map of the world with UFO sightings, it's not very useful. He focuses in on the US, and uses good cartography for the map (really important). It's a little more useful. However it's still a population map.\n\nLet's look at the data over time. He shows an animation over the map. There's not really a pattern there. It's aphenomenon that seems the same across the world.\n\nHe tries to pick out a pattern in the shape of the UFO sighting. There's no pattern there either.\n\nMaps can only show one or two pieces of information in a map at any one time. \n\nWhen thinking of spatial data it's important to put context in around it.\n\nHow can we make the data better? Normalise it.\n\nWe could aggregate it to some geometry.\n\nTake a polygon of a county in the US and show us how many UFO sightings there have been in that county.\n\nHe shows a map of counties in the US, the darker counties have more UFO sightings, the lighter have fewer. But it's still a population map.\n\nWe've been working on a project called the data observatory. We've taken measurements from the US census.\n\nGithub: CartoDB/bigmetadata\n\nWritten in python. You can help us include more data sets. \n\nWhen we normalise the the data by population. We can look at the percentage of people in each county that have seen UFOs.\n\nWe can also show a histogram of the most UFO sightings. \n\nBut how do we know if this pattern is real or now? How confident can we be that this is telling us the truth or is significant?\n\nWe need a model about how our data was generated. We can use that to test our hypothesis about whether it's accurate. We can run the data through statistical tests to make sure these things are real.\n\nI'd like to take about ways to do that.\n\nEg fMRI (functional magnetic resonance imaging)\n\nThere was a study recently published that show most of the studies on fMRI in the last 30 years were wrong. The reason they were wrong were that they weren't thinking spacialy enough.\n\nMost things you can think of, there's usually something specially to consider. Quote: \"Things that happen close to you are more likely to affect you\"\n\nThey'd used a wrong spatial inference.\n\nHe shows this comic: https://mathwithbaddrawings.com/2016/07/13/why-not-to-trust-statistics/\n\nMapping can distort distribution of data.\n\nIf you don't take into account spatial distribution of your data, you could make the wrong decision.\n\nThere's a bunch of statistics we can use to check your data.\n\nMoran's I : https://en.m.wikipedia.org/wiki/Moran%27s_I\n\nWe're going to apply Moran's I to the UFO data.\n\nWe're looking at the data in relation to it's neighbours, it will tell us if that county is high compared to the surrounding area.\n\nWe've found a cluster of data that's statistically significant. These are pools of sanity in amoung areas of questionable judgement.\n\nPysal - library. https://pysal.readthedocs.io/en/v1.11.0/\n\nGEographically related regression.\n\nRegression analysis. You take 2 data points. Eg Enjoyment of Bob Dylan's music vs age. You start with an intercept and you have a trend. It's simplified, but it helps track.\n\nThe problem with applying it to geospatial data is that it lumps together.\n\nEg access to public transit vs cost of house. Cities higher cost per house for living close to public transport, but in a rural area it's the reverse.\n\nEg Georgia, the US state. We have a map showing the number of single people, the state is coloured by that data. We ran a geographically related regress. The first one we ran was poverty, then we understand the rural context, then we looked a ethnicity, ie white non white.\n\nWe we tagged on rural - there was a north south divide. We could see how much the fact people were single was affected by their location.\n\nOne of the most interesting regressions in this data set was diversity. In more areas of diversity, you were move chance of being single. This analysis is important for understand how you might eg tackle HIV infection.\n\nThe next time you make a map, make it insightful, add some data, but think about running some statistical analysis. We're trying to build some tools to help you.\n\n\n",
    "id": 140,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-thinking-spatially--how-location-inte/export/txt",
    "empty": true,
    "character_count": 0,
    "term_occurrence": {
        "open": 0,
        "libre": 0,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}