{
    "session_id": 152,
    "title": "Build an open source ethical CS program",
    "views": 23,
    "total_favs": 40,
    "fav_count": 44,
    "unfav_count": 4,
    "session_notes": 10,
    "space": "Demystify the web",
    "pathway": "The Future of the Web",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016--build-an-open-source-ethical-cs-prog",
    "notes": "Workshop Overview (Building an Open-Source CS Program to Foster Ethical Innovation)\n\nWe’ll tear apart the traditional “amoral” CS curriculum for high school students, which focuses on technical skills without a consideration of the ethical dilemmas presented through the creation of those tools. Participants will develop course offerings which will invite & entice nontraditional students (journalists, activists, artists, etc.) into the CS program. Our current working outline includes courses such as Google vs. Oracle (learning Java while developing an understanding of the open source software ecosystem), Margin of Error (exploring pattern recognition, machine learning, and artificial intelligence and how seemingly small margin of errors have real-world impact when applied to modern machine/drone warfare), Echo Breakdown (privacy, security, systems, and the internet of things), and the Snowden Files (developing data structures, data collection, and the potential misuse of seemingly innocuous data).\n\nThe session will result in a curriculum designed to foster technical innovation grounded in global ethics. Students who go on to pursue CS at the college level will do so as activists, with a critical point of view, or pursue fields related to CS such as law and tech . The curriculum will be shared freely under an open license so educators can implement the full CS program, a subset of courses, or units of interests at their institution. \n\nInstructions:\nAs you walk through \"gallery\" of course ideas on the wall, please add post it's with:\n\t1.   Questions/suggestions you have about the course.\n\t1. Questions students should be able to ask after taking the course.\n\t1. Missing resources/perspectives\n\nComputer Science Electives Designed to Foster Ethical Innovation\n\n\nThe following series of courses use a single event or action, a lawsuit, a device, a data breach, etc., to explore an area of computer science.Through these lenses we can learn the history, persons, and technologies that have helped create the modern world. We hope that you take one of these courses and fall in love with power and complexity of CS and take further courses in the department.  Courses are intended to be taken\n\nThe following courses are intended to be offered year-long and meet twice a week.,, or to be sampled as small activities within an existin CS curriculum. \n\nCS Literature - In this course we will use non-fiction books to learn about the history of computing and its contemporary state of innovation. In particular we will look at how the different government projects lead to the birth of modern computing and how it evolved into a massive industry that touches on many part of modern life via Walter Isaacson’s The Innovators. In the second semester we will study how the US waged a clandestine war against the Iranian nuclear program via Kim Zetter’s Countdown to Zero Day. (Innovation, Computing History, Transistors, Binary, Boolean logic, circuits, personal computer, internet, viruses, malware, reverse engineering)\n \nParticipant contributions: \n\t* The change in gender and programmers. Originally seen as \"women's work\" until pay increased, so it became male work. \n\t* Limits of Law v Speed\n\t* Lovelace+Baggage comic+poet\n\t* Translation CS languages 'people made it'\n\t* Examine notions of \"inevitable\" march of progress vs. market forces/conditions\n\t* Computer engineering-\"the Sould of a New Machine\" (1989) Mielifeon \"Computer: A startup Odyssey\" (2013) \"the Superman\" (1999)\n\t* How did the minuteman ICBM influence microcomputer design?\n\t* How innovation balances with maintaining see themaintainers.org\n\t* Dream Machine by Waldrop\n\t* Who assesses if technology above human (????) implication on society, safety and privacy?\n\t* Films: Pirates of Silicon Valley (1999) (Mac v Windows)\n\t* Film: Micromen BBC (2009) (Acorn vs. Sinclair)\n\t* The history or history of how code came to be\n\t\t* Shows how/why popular languages were created by white men who spoke English\n\t\t* Also, the fact that it was created by humans  means that it's imperfect --->Ramsey Naser wrote a language in Arabic\n\nSecrets and War: The first computers were built during World War Two to aid the Allies in breaking secret codes. In this course we will use the lens of cryptography to study the development of modern computing. We will study ancient ciphers, how they are deciphered and trace the history of the first computers used to break code. Then we will look at modern encryption keeps the internet secure and when it fails. (Information security, ciphers, encryption, decryption, algorithm, sorting, libraries, Python, C, blockchain, bitcoin)\n        \n“I tried to tell Bletchley Park what my ideas were, but you must understand the technology that I was using was then only just known to very few people in the whole world.” - Thomas H. Flowers. \n\nParticipant contributions: \n\t* Is it ok to spy on enemies---but who are our enemies?\n\t* Is spying in any form dangerous?\n\t* Explore how encryption is treated in different parts of the world by different governments. \n\t* Certain levels of encryption illegal or classed as a weapon\n\t* Data breaches EG sony\n\t* Can you create fully 'technical' solutions? What does this mean for the humans?\n\t* Are there special rules for war? Are the \"War on ...drugs/terror\"....wars?\n\t* Cultural context (UK) of spies seen as \"sexy\" or \"heros\" post WWII--now ok with GCHQ because of this past. \n\t* Post WWII use of enigma-based machines, intercepts by UK\n\t* What about different states, is it ok for US to crack to catch terrorists but not other countries (Russia, etc.)?\n\t* Why is it 'ok' to use decryption against foreign residents but not are own. Are we ok with that?\n\nThe following course are semester-long and should be combined to create a year-long course.\n\nGlitch and Generative Art: Can computers make art? Can they make art on purpose? By mistake? The answer is YES and it looks great! In this course we will use to code to remix existing art, make new pieces, and create pieces that are accidental or depend on the actions of an user. (Processing, HTML, CSS, JavaScript, p5.js)\n\nParticipant contributions: \n\t* Who gets credit? How do artists get paid?\n\t* How much and how do you need to modify something before it's \"yours\"?\n\t* Examine closed vs open tools within art creation. What are the consequences?\n\t* This seems like a great way to dig into the code. Code itself +code output as an art. How changing modules or variables can lead to intentional and unintentional results. \n\t* Remixing code as a discipline-specific practice\n\t* Get kids to implement github.com/revisitors\n\t* Do you own creations generated by randomization?\n\t* How do you measure attribution in digital collaboration projects?\n\t* Hito Steyerl\n\t* What about including copyright/mash-ups? If you use digital elements of different works--is it right? Should it be allowed?  (???) vs. different (????) the world. \n\t* Play-act a court case between code maker and artists. Both claiming ownership of the work. \n\t* How is generative art different than conceptual art?\n\t* What languages wil be used? Higher level things like processing/tracerr/MaxMSP or Phythong/Javascript?\n\t* Generative music in 60s minimalism. \n\nAmazon Echo Teardown: We will try to answer questions such as: How does the hardware and software work? What does it mean for the future of tech? Should we trust it and Amazon? (approximate computing, architecture, privacy, knowledge systems, wireless sniffing, voice recognition)\n\n“The Amazon Echo is the first smart consumer electronics product since the smartphone that’s poised to become a daily habit for millions” - Anil Dash.\n\nParticipant contributions: \n\t* DRM in physical things such as print cartridges and coffee cups?\n\t* Design an ideal echo and then work from that to a feasible one and then compare with reality. What are the trade offs?\n\t* Explore alternative. Do they exist? What would they look like? Would they work?\n\t* What can I do to prevent over sharing?\n\t* Play act some scenarios in the context of a murder mystery. You ordered a knife on amazon on the night in question!!!\n\t* How do other internet connected devices handle security? ccTVs, ALPRs, IoT devices from China, your phone?\n\t* How do you know how Amazon collects/uses the data? It's closed source!\n\t* Wht should be private? It it ok for corporate surveillance in your home? What if what Amazon is able to infer from your data changes (expands) after you have given them consent?\n\t* How people can understand this and what they are consenting to\n\t* Explain that Amazon and other valley companies make money from data and then use Wireshark(/similar) to show how much data is flowing from the device to Amazon versus Amazon to the device\n\nGoogle vs Oracle: We will use this case to explore what Application Program interface, APIs, are, how open-source works, and how law and tech interact. (Application Program interface, Java, Android, open-source, copyright)\n\nParticipant contributions: \n\t* Are APIs essential to open source?\n\t* Is it ethical to license software?\n\t* How can I create an API?\n\t* Who has access to APIs? Who can use them?\n\t* What is fair use?\n\t* Patents\n\t* Should school work be open source?\n\t* IP protection, licensing, patents\n\nSnowden File: How do computer networks support surveillance? How is data stored? How did it get leaked? How do the courts and the law control these systems? (Encryption, surveillance, data systems, metadata, law and government)\n\n“The document shows for the first time that under the Obama administration the communication records of millions of US citizens are being collected indiscriminately and in bulk – regardless of whether they are suspected of any wrongdoing.” - Glenn Greenwald.\n\nParticipant contributions: \n\t* Current events such as iPhone hacking court case, Snowden & wikileaks\n\t* Case where facebook allowed targeted ads based on gender and sexual identity led to target \"gay male nursing students\" info shared with the university. \n\t* Students look at what permissions they have granted their phone apps. \n\t* How many data points needed to re-ID an \"anonymous\" user?\n\t* What alternatives do they have to traditional data collection exposure?\n\t* Should the government hve access to user information?\n\t* Would Snowden be able to leak the info if the system was properly designed?\n\t* In this case, poor security helped activism. \n\t* Is there data that should not be gathered?\n\nMargin of Error: In this course we will study how Artificial Intelligence understands and interacts with the world. We will seeks answers to questions such as: how does AI see the world? What can it do? How do we control it? What amount of error is acceptable? (Algorithms, Data structures, Risk modeling, Computer vision, Autonomous drones)\n\n“I’m increasingly inclined to think that there should be some regulatory oversight, maybe at the national and international level, just to make sure that we don’t do something very foolish.” - Elon Musk.\n\nParticipant contributions: \n\t* Is AI different from other algorithms?\n\t* What are different applications of AI (with positive examples)?\n\t* Give students solvable problems to make them feel invested in something achievable\n\t* Can an AI be morally or legally responsible? If not, who is?\n\t* Can we contribute to the AI logic? How? Who?\n\t* What happens when a training data set (police stats) are biased)\n\t* Ethical red teams\n\t* Are these systems used for decision support? How are they presented?\n\t* Realistic self driving car and other current example for ethics/philosophy class rather than theoretical/useless ones used now. \n\t* How do they add knowledge that is hard to quantify?\n\t* Explore the relationship between AI and gender\n\t* How do predictions affect future data collection?\n\t* How do we define/articulate AI vs other algorithms?\n\t* Who creates AI? What bias to they build in?\n\t* What decisions should be left to AI?\n\t* How to make sure AI is not biased?\n\t* How can we ensure AIs decisions won't harm people? Google car example. \n\t* Weak vs strong AI\n\t* AI systems to vet CVs sent to big companies (Google/FB/Amazon...) learnt off current employees' CVs, so fewer counts of having attended a girls' school, or playing \"girl\" sports, etc. What are the models learning from?\n\n#BlackLivesMatter: In this course we will trace how the movement grew on Twitter. We will answer questions such as: How does online activism lead to offline justice? How do social networks connect people and ideas? How have smartphones made activism viral? (Network theory, Social network, database infrastructure, Full-stack web development)\n\n“BLM's high visibility and success in eliciting elite responses have positioned it at the center of the national conversation on police misconduct.” - Deen Freelon, Charlton D. McIlwain, and Meredith D. Clark.\n\nParticipant contributions: \n\t* Why didn't #blacklivesmatter trend on Facebook even though people were posting?\n\t* What about police involvement--shutting down FB profiles of activists?\n\t* What happens where Twitter is down? Try to explore alternatives for communication. \n\t* What are the roles for physical interactions now for politics?\n\t* Do the owners of social networks hvae too much say in what movement gets attention?\n\t* Is a truly democratic online movement a possibility or a dream?\n\t* What's the historical context of BLM movement?\n\t* Are there circumstances in which online activism can be a \"cop out\"/distraction from more meaningful activist activities. \n\t* Adding to above---clicktivism. \n\t* What about how this doesn't work on FB? Algorithms can silence activism. \n\t* Can movements fuel each other on the social web?\n\t* What does online activism mean for \"who\" is/can be an activist?\n\t* Broaden this to more global examples\n\t* Also, ask did this (#blacklivesmatter) lead to social justice? What precisely did it accomplish?\n\t* Have students read LIssa Soep's white paper on participation politics or engage with some of her case studies\n\t* Language issues: Protests or issues in non-Latin based languages rarely get global focus. How does language barrier hold back activism?\n\t* You are CEO of Twitter. Your biggest advertiser doesn't like what they are seeing. What do you do?\n\t* For global movements, are social networks too geo-specific. \n\t* How does trending algorithm keep you focused on very local, not global, issues that are only in your language?\n\t* Arab spring + what happens when Twitter is blocked? Other apps? Less safe? More safe?\n\n\nNew ideas/courses/topics that could be included in other ideas or spin off to their own courses:\n\t*     Bioinformatics. Who owns my genetic data?\n\t* It it necessary to sometimes be \"under-utilized\"\n\t* Cost of \"free\"\n\t* Including that cancer gene I have...see BRCA lawsuit/patent over genetic testing (breast cancer)\n\t* If there is no price of a product you are the product\n\t* \"under the hood\"\n\t* developer tools\n\t* \"narratives\"\n\t* Business tht claim they are only an 'app' or online platform so they have 0 employees\n\t* Is efficiency  at the cost of jobs a worthy goal? Should we create apps that we know will displace workers and eliminate jobs?\n\t* Discussion about the jobs that are not being moved/shifted, just destroyed. What does that mean for a new type of innovation that maintains employment and doesn't replace humans?\n\t* What are the economic externalities of the product?\n\t* Data flow v data control\n\t* Capital vs district. Do you live in the capital or the district (look at your computer and your devices) re:hunger games. \n\t* Tech access globally\n\t* Filter bubbles: how do sites select \"engaging\" items for me?\n\t* Role of \"consent\" in data use\n\t* Data as an asset during private mergers and bankruptcy \n\t* \"FB is the new Stormfront\"\n\t* What does Facebooks/Twitter use my data for?\n\t* \"Echo chamber\"\n\t* How does Facebook make money?\n\t* Algorithm and people\n\t* You are the product\n\t* Silicone valley economics and culture\n\t* What is the difference between the \"tool\" or real employee management\n\t* Free software and open source. Improving access to tech\n\t* Low cost freelancing can be a great way of bringing money into the developing community or it can be a real ethical problem\n\t* How to help marginalized groups/group with little free time to bring their voices to the open source movement\n\t* \"day in the life\" \n\t* \n\nIntro to CS (Required? Decide in 2017?): This course will introduce the fundamental concepts of CS, including functions, data types, recursion, control flow, so that you are ready to tackle deeper questions and seek answer in the field. We will use this class to build our own website where we can share our work with the world. \n\n\nResources:\nComputer Science as Liberal Arts 'Enabler' - A scholarly perspective from people at Grinnell and Swarthmore. \nComputer Science and the Liberal Arts: A Philosophical Examination - Bates and Union College are taking innovative approaches to CS education.\nSummer Reads from Restart Project\n\nEvents to build excitement and interest in CS\nHour of Code during Computer Science Education Week in December- An international event, led by code.org, where people of all ages can do some coding and get a better sense of what Computer Science is all about. \nHackathons - Attending and hosting hackathons are a great way to take CS out of the classroom. These half to full-day event provide middle and high school students an opportunity to collaborate on projects of interest. There are no student hackathons focused on ethics and justice.\nStartup Weekend - A more intensive option that brings together coders, designers, and founders to build working prototypes that has the potential to be successful in the market. \nClubs - Informal groups can help create excitement by focus on single topics, for example, video games, sci-fi,  \n\nThought Partners / Guest teachers & lecturers\nAnil Dash                                                     \nRobyn Caplan                                                                                                                                       \nLam Thuy Vo      \nPaul Ford                                              \nJenna Worthman\nErica Joy  \nDan Shiffman \nMatt Mitchell\nSonali Sridhar  \nDavid Nolen\nAllison Mccann\nDaniel Fenjves \nEmily Reid \nCasey Johnston\nLauren Gardner\nAllison Parrish   \nTaeyoon Choi    \nGene Kogan\nAinsley O’Connell\n Christina Jenkins    \nIlleana Jimenez  \nFrancis Tseng  \nLeah Gilliam  \nAlex Qin     \nJade E. Davis  \n",
    "id": 152,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016--build-an-open-source-ethical-cs-prog/export/txt",
    "empty": false,
    "character_count": 18443,
    "term_occurrence": {
        "open": 11,
        "libre": 0,
        "innovation": 7,
        "inclusion": 0,
        "privacy": 3,
        "science": 6
    }
}