{
    "session_id": 254,
    "title": "P2PU - Online learning face to face",
    "views": 36,
    "total_favs": 47,
    "fav_count": 49,
    "unfav_count": 2,
    "session_notes": 14,
    "space": "Demystify the web",
    "pathway": "",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-p-pu---online-learning-face-to-face",
    "notes": "Welcome to Etherpad!\n\nThis pad text is synchronized as you type, so that everyone viewing this page sees the same text. This allows you to collaborate seamlessly on documents!\n\nGet involved with Etherpad at http://etherpad.org\n\n\n\n\"Anyone can learn anything, anywhere, for free.\" < Question to the room, please help us edit this statement.\n\nLots of things are online, but I need to have digital literacy and connectivity to get to it.\n\nChanging it to \"Anyone with a friend or with sufficient digital literacy can learn anything, anywhere with connectivity for some sort of cost (in theory)\n\nWhat about motivation?\n\nAnyone with a friend or with sufficient digital literacy and a good amount of motivation can learn anything, anywhere with connectivity for some sort of cost (in theory)\n\nWhat about the types of things? With my university courses there are a lot of people (other than you) deciding what they think you should know.\n\nWe're editing the statement further...\n\nEven if someone does learn something, will it result in anything. Will they get a promotion or a job?\n\nThe statement we ended up with: \n\n\"Anyone with a friend or sufficient digital/linguistic/literacy (+other literacies) and a good amount of motivation and also knows where to look can learn a lot of mostly Western orientated things that already exist, anywhere with connectivity, for <strike>free</strike> some sort of cost (In theory), but these people won't actually know if they learned anything... but what is the point anyway? [If you complete a mooc in the woods, and nobody else knows, did you actually complete it?]\"\n\n    https://twitter.com/twitrnick/status/792297204929232896\n\n--------\n\nOur mission is to provide communities with online peer learning experiences regardless of their digital background. Our method is to combine online courses, conniption centres and open source tools to create fact to face learning circles.\n\nWe've been calling this work learning circles. We started in a library in Chicago the US. We work with a group of between 4 and 12 (in reality between 1 and 35 people). We work with an organiser who's not an expert in public speaking or course or web design, but is comfortable delivering the course for 6 weeks.\n\nWe've expanded to public libraries in Paris and Kanya. Our open source community is I across the world, people use our tools from across the world.\n\nWe've gone from working in 2 branches in Chicago to working in 20. We think this is core to the role of the library in the 21st century. A lot of people who take part don't have computers. We're developing a community and have people coming back week after week to learn resume writing or how to use Gmail. Also in Nairobi/Nakuru people are currently learning CSS and HTML < 3 weeks in everyone's built their own web pages.\n\nWe've expanded in Boston and Portland and Providence. The bottleneck there is only the lack of qualified english language learning instructors. \n\nWhat's cool is that people are using digital online materials in different ways. They're making things relevant and exciting for where they live.\n\nThese are all examples of physical spaces looking for people, but also content that's looking for people. \n\nThe potential of this project is not just to create better programming needs, it's also about better education later in life.\n\nQ. How do you start these sessions?\nA. We promote them primarily through the community centres. We get the basics like the timing and generate a web page for them. We give them sample facebook posts or tweets. We try not to highlight that it's an online course. We promote it through asking 'do you want to be a better speaker?'\n\nQ. How did working in Nairobi come about? How did you get involved with libraries?\nA. The idea for the project has been going for a long while. We were looking for a community that made sense . It seemed that libraries complemented what we wanted to do. People trust libraries. In 2013 we applied to the Knight foundation. We got funding to work with libraries. They work well. We're usually either partnering with people who are invested in the content, but also working with people who want to get communities working well. Eg in Chicago I facilitated the first sessions with the head of adult centres. \n\nQ. Do you work with UKonline centres?\nA. We're interested in that.\n\nQ. How difficult is it to go and get something started? VS having your tools used by others?\nA. We can't scale everywhere. That's what we'd like to take about today. How do we scale this up? We've found that going to get it started, finding out more about the librarian is like, then be on call 2 hours a week, that seems to be enough.\n\n--------\nNow the bit where we write our ideas down on paper.\n\nWe had 3 questions for you:\n\nCommunity: Where would you like to see our work?\n- Public libraries are a template or model, but we should think about other sorts of communities.\n\nCourses: how do we generate new courses to fill gaps?\n- Localising content is important.\n\nTools: What do we build and develop to support facilitators and learners?\n- community brand is important. If the brand is recognised it might have more value. Grif: we started by thinking of the brand, but we realised we wanted this to be more about the community. We want that to be front and centre.\n\nCheck out or tools on P2P.org (https://www.p2pu.org)\n\nDevelop materials for learning circles: how to.p2pu.org\nJoin the team: thepeople@p2pu.org\nJoin our community: bit.ly/p2pucommunity\n\n\n\n",
    "id": 254,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-p-pu---online-learning-face-to-face/export/txt",
    "empty": true,
    "character_count": 0,
    "term_occurrence": {
        "open": 0,
        "libre": 0,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}