{
    "session_id": 382,
    "title": "Let's ask all our embarrassing data questions",
    "views": 19,
    "total_favs": 46,
    "fav_count": 50,
    "unfav_count": 4,
    "session_notes": 4,
    "space": "Journalism",
    "pathway": "",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-let-s-ask-all-our-embarrassing-data-q",
    "notes": "Welcome to\nLET'S ASK ALL OUR EMBARRASSING DATA QUESTIONS\nby @lisacrost\n\nSunday, 12.15pm, 804 (journalism space) at #mozfest, London\nhttps://app.mozillafestival.org/#_session-382\n\nInstead of posting them here, you can also tweet at #datavizhelp. We will try to answer all these questions in the session at the Mozilla Festival, but also in this Etherpad and maybe as an extra blog post on lisacharlotterost.github.io. \n\n\n\nASK YOUR QUESTIONS HERE: \n=========================\n(if you know the answer, feel free to answer it directly here!) \n\n\t* What's better for journalism, Mapbox or Carto? What should I get into? \n\t* What’s the difference between SQL and SQLite? \n\t\t* A: SQLite is a specific database software that uses the SQL language to handle  data. There are other pieces of software like MariaDB or Postgres that also use SQL. Each has their own dialect. SQLite is used widely, e.g. in any Android phone, but it is also limited, i.e. it cannot handle many people updating the database at the same moment. \n\t* What are you all using as the  minimum font size for mobile data vis? \n\t* Where do you all get your inspiration from? \n\t* Is it ok to use concepts from public examples (blocks) without attribution? E.g. your district diff bar\n\t* Are there easier tools than d3.js / leaflet?\n\t\t* A: there are a few libraries built on top of d3 that simplify things for common chart style. For instance, http://c3js.org and http://dimplejs.org. If you want to avoid javascript altogether, it's even possible to use FF Chartwell, a font to generate simple charts: https://www.fontfont.com/how-to-use-ff-chartwell. An alternative to Leaflet might be Carto (formerly CartoDB) or Mapbox. These have fairly web-based authoring tools and you can embed the resulting map / visualizations into your page. D3plus (https://d3plus.org/) is apparently slightly easier than the vanilla D3, though I've not used it myself.\n\t* How do you get a start in data journalism? \n\t* What's a SPARQL query?\n\t* How to use an API?\n\t* What is SPARQL endpoint?  \n\t* What are the best places to watch for new and interesting data to feed stories? \n\t* What's the best way to find data? \n\t* What exactly does \"scraping\" mean?\n\t* How can I more reliably bin data for choropleth maps? k-means? quartile? quantile? \n\t* How can I make sales/usage data comparisons between markets when the markets vary? \n\t* Are there any good/clear resources for better understanding of \"overpass turbo\" queries in OSM?  \n\t* I'm a computer scientist, so I know embarrassingly little about statistics. When do I have to do a hypothesis test rather than just showing plots? \n\t* What is a p-value, really, and when is it important? \n\t* Where does data come from? \n\t* Does your audience really interact with your interactive dataviz? \n\t* What is the smallest font size you're all using on mobile? \n\t* I work in data visualization, but I have 0 formal knowledge about statistics. I feel I should learn it. Where to start? \n\t\t* formal knowledge is not so important, and that you can read up important stuff as you go\n\t* I have some random data, how can I best visualize it? \n\t\t* A: If it is in a spreadsheet. Excel or libre office may be the easiest.\n\t\t* A: Depending on the purpose and how tech savvy you are, there are loads of tools and approaches (examples: http://lisacharlotterost.github.io/2016/05/17/one-chart-tools/). \n\t* My charts are always ugly, what can I do to make it better? \n\t\t* A: Reduce cruft like superfluous lines, scales, reduce amount of colors. \n\t\t* A: \"The Wall Street Journal Guide To Information Graphics\" is good for a start to learn more.\n\t* I want to gather data on how people use my website. Where do I start? \n\t\t* A: Use an analytics tool tool like Piwik (free + open source) or Google Analytics\n\t\t* A: It makes sense to think about specific questions first and figure out how to do it with your analytics tool\n\t\t* A: There are server statistics that get collected automatically. This requires more technical knowledge. If you are part of a bigger organization, there may be someone who can help you with this\n\t* Data \"pipelines\": What are good ways to automate certain data related tasks? \n\n\n\n\n\nNOT SURE WHAT TO ASK? \n=====================\n\nMindset to have: \n--------------------\nSelf-taught as many of us are, we all have gaps in our knowledge and skills that other people can fill. \nAnd we all can fill other people’s knowledge gaps.\nNobody was born knowing all that stuff. \n\n\nQuestions to ask: \n---------------------\nWhat is... \nHow can I make... \nAm i dumb if it... \nIs it ok to...  \nWhen would I need... \nHow are you all dealing with...\nIs there a better way to... \nWhat is a good tool to... \nWhy on earth would i use... \nHow can I learn to...\n\n\nThings to ask about: \n--------------------------\nEverything that's data vis / data journalism related! For example: \nvisualization \ncleanup \nanalysis \ncolors \nresponsive \nJSON \nPostGIS \nMongoDB \nSQL \nEthics \nresources to learn\nSQLite \nDatabase \nboxplots \nd3 \niframe \nmining \nsanity \nCSV \ntooltips \nterminal \neditors \nR\nslope graph \nAdobe Illustrator \nMapbox \nBins \nsqrt \nData-ink-ratio\nGithub \ninteractivity\nteam \nchoropleth maps\nAPI \nggplot2 \ndplyr \ntypefaces \nsources \nsanity\n...and aaall the other things \n\n\n\n\n\n\n",
    "id": 382,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-let-s-ask-all-our-embarrassing-data-q/export/txt",
    "empty": false,
    "character_count": 5236,
    "term_occurrence": {
        "open": 1,
        "libre": 1,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}