{
    "session_id": 477,
    "title": "Beyond the Hero's Journey - What do we mean when we talk about 'storytelling'?",
    "views": 59,
    "total_favs": 46,
    "fav_count": 51,
    "unfav_count": 5,
    "session_notes": 7,
    "space": "Digital arts and culture",
    "pathway": "Storytelling",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-beyond-the-hero-s-journey---what-do-w",
    "notes": "Not storytelling\n\nNo save the cat\nNo 3 act structures\n\nStory telling\n\nThe revelation of connected information over time\n\nThe order in which the things in the Story World and their connections are revealed\n\n\nBeyond the Hero's Journey - What do we mean when we talk about 'Storytelling'?\n\nWelcome! This is a public etherpad for the attendees of (and indeed those interested in) the session at Mozilla Festival 2016 to chat, take notes, and ask/answer questions about the session.\n\nThe format for the session will be:\n    \n    - a short talk by Paul around storytelling, and five particular aspects of storytelling craft\n    - discussion amongst the attendees\n    - presentation back of group discussions\n    - conclusions and next steps\n    \nThe hope is that the talk will generate enough interest and discussion points to fuel the rest of the session, and if this does seem to be something that people are interested in, let's keep in touch (you can enter your contact info here, or talk to Paul directly)\n\nThe rest of this space is up to you - I hope you enjoy the session!\n\n** LINKS **\n\t* Slides are here: https://speakerdeck.com/r4isstatic/beyond-the-heros-journey-what-do-we-mean-when-we-talk-about-storytelling\n\t* Jason Mittell - Complex TV: The Poetics of Contemporary Television Storytelling http://nyupress.org/books/9780814769607/\n\t* Complex TV online http://mcpress.media-commons.org/complextelevision/\n\nSome other questions to ponder:\n    \n    Time\n- when is chronological time useful? When does it hinder?\n- can ‘not making sense’ be helpful (contradictions?) What effect?\n- how might you take advantage of discourse time? What are the dangers here? (implicit connections between events, Adam Curtis style)\n- do we make enough of narration time online? What could we do with it? e.g. releasing storyline of a game a bit at a time…\n\nStorytelling as ‘the revelation of connected information over time'\n- how do you choose what to reveal, and in what order?\n- how important are the connections? Do you play that up? Are they explicit/implicit? What are the advantages/disadvantages of both explicit/implicit?\n\nNarrative statements vs narrative enigmas\n- community management/engagement - when are statements and enigmas helpful? how might they shape your discussions?\n- journalism in this context? combined with over time…?\n- what are the differences in engagement between enigmas and statements? what behaviours do we see? how might we harness that, prevent its’ worst excesses?\n\nPlot driven vs tonal narrative\n- what are the advantages/disadvantages of either?\n- when might one be useful over the other? What is the intent behind their use? Emotional engagement above information finding?\n- how might self-contained narratives (which are more ‘tonal’) have an aggregate effect? How might they be connected together/combined/remixed?\n\nSurprise memory vs working memory\n- frustration on the part of users/audience when their memory is more acute than characters - limits of context and pre-programmed responses/design etc\n- how do you trigger working memory without being heavy handed? Needs to be satisfying/subtle, but effective. How does that bias things? Red herrings?\n- could we use surprise memory more? It tends to be more satisfying/pleasurable….\n\nOperational aesthetic and narrative special effects\n- do they work for you? or frustrate you?\n- not necessarily marvelling at the technology, but at the dazzling construction of the story (Hiro’s room of cards/string interconnected etc)\n- narrative special effects when it all fits together...\n\nJournalism\n- fast journalism is very plot driven, very narrative statement heavy, but not necessarily chronological\n- how might journalists play with some of these techniques to be more effective in their aims?\n",
    "id": 477,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-beyond-the-hero-s-journey---what-do-w/export/txt",
    "empty": false,
    "character_count": 3770,
    "term_occurrence": {
        "open": 0,
        "libre": 0,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}