{
    "session_id": 686,
    "title": "How we can use 360 Video, Binaural Audio, VR and Pokemon Go to tell new stories",
    "views": 33,
    "total_favs": 35,
    "fav_count": 38,
    "unfav_count": 3,
    "session_notes": 18,
    "space": "Journalism",
    "pathway": "Storytelling",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-how-we-can-use-----video--binaural-au",
    "notes": "How we can use 360 Video, Binaural Audio, VR and Pokemon Go to tell new stories\n\nWe’ll set up a number of activities to experience the very latest immersive stories. We’ll discuss what works, what doesn’t and how we could improve these experiences. We’ll talk about demographics, user bases and what’s possible and how. In the second half of the session we’ll take some time to build our own 360 video and binaural audio of the Mozilla Festival and publish it online for people to experience.\n\nIntro\n\nTHE BIG QUESTIONS\n\nWhat are the capabilities of immersive technologies?\n\nWhat stories can we tell with all this amazing technology?\n\nHow do we make our stories and ideas real?\n\nWhat's open and what's not?\n\n\nStructure:\n    \nGiven the amount of time we have and given that a lot of the demos can only be experienced by one person at a time -  suggest we interleave group work with pauses to try out and reflect on the demos. We can break out into groups to try out the various demos, recount the experiences, talk a little about the possibilities, then get back to sketching. Experience - talk - sketch - talk - experience - talk - sketch - talk - bake! \n\nAt some point we'll do a live demo of recording binaural audio and 360 piece.\n\t\n\nFacilitators:\n\nWerner Bleisteiner - @bleisaetze\nMark Boas - @maboa\nLaurian Gridinoc - @gridinoc\nNicola Hughes - @girlmeetscode\nDan Schultz - @slifty   ( where dan at? 8-D )\n\nTech:\n    \nWhat is Virtual Reality? What is 360 Video? What is binaural audio? What is Pokemon Go and why are we even talking about it?\n\n(What's open, what's not - what's free, what's not)\n\nProduction Hardware:\n    \nBinaural:\n    \nEar microphones (dual channel)\n\nZoom H2n recorder\nZoom H6\nTascam Ster Pre-amplifier (iOS) \nhttp://tascam.com/product/ixj2/\n\nGoogle Jump:\n https://vr.google.com/jump/ (expensive equipment - pay for cloud compute - open source???)    \n \n\nProduction Software / Services: \n \nUnity 3D:\n https://unity3d.com/learn/tutorials/topics/virtual-reality (Free trial plan for hobbyists - exports to WebGL)\n \nOculus Rift for Developers\nhttps://developer.oculus.com/webvr/\n\nA-FRAME\nhttps://aframe.io/\n\nGuriVR: \nhttps://gurivr.com/ (source https://github.com/opennewslabs/guri-vr)\n\nReaper DAW: \nhttp://www.reaper.fm/download\n\nFB360 Spatial workstation (formerly known as TwoBigEars):\nhttps://facebook360.fb.com/spatial-workstation/\n\n \nExperiencing:\n    \nSmartphone\n\nGoogle Cardboard / Google Daydream\nhttps://vr.google.com/daydream/\n\nOcculus Rift\nHTC Vive\n\nYouTube in browser (Firefox Chrome), YouTube Andriod app (>4.2) >iOS YouTube app does not -yet- support spatial/binaural rendering\n \nExamples:\n\nBINAURAL AUDIO: TECHNOLOGIES AND DEMOS\nhttp://blog.br.de/highend/binaural-demos/\n\nBBC Proms in Binaural\nhttp://www.bbc.co.uk/taster/projects/proms-binaural\n\n J.G. Ballard radio plays in binaural by BBC\nhttp://bbc.in/2e7Q4CO \n\nElectronic empathy: meet the next wave of virtual reality   \nhttps://www.theguardian.com/media-network/2016/sep/08/electronic-empathy-virtual-reality-pokemon-go-oculus\n\nbjörk: stonemilker (360 degree virtual reality)\nhttps://www.youtube.com/watch?v=gQEyezu7G20\n\nBlackout: experience strangers' inner thoughts in a NYC subway (RGBD recorded volumetric video + binaural audio)\nhttp://blackoutvr.com/\n\nBrexit interview in 360 video + audio prototype\nhttps://hackdash.org/projects/57658168d9284f016c046feb\n\nhttps://vragments.com/fader/\n\n\nFurther reading:\n\nVR in the newsroom: Don’t wait too long, don’t spend too much\nhttps://medium.com/global-editors-network/vr-in-the-newsroom-dont-wait-too-long-don-t-spend-too-much-ea3c7d53d490#.nt127asw3\n\nReport: 2016 will be critical for growth of VR in journalism\nhttp://www.niemanlab.org/2016/03/report-2016-will-be-critical-for-growth-of-vr-in-journalism/\n\nGURI VR: VIRTUAL REALITY FOR THE REST OF US\nhttps://source.opennews.org/en-US/articles/virtual-reality-rest-us/\n\nHow I Became a Ghostbuster\nhttps://blogs.nvidia.com/blog/2016/09/15/how-i-became-a-ghostbuster/\n\nVirtual Reality, Empathy and the Next Journalism\nhttps://www.wired.com/brandlab/2015/11/nonny-de-la-pena-virtual-reality-empathy-and-the-next-journalism/\n\nVirtual reality is journalism’s next frontier\nhttp://www.cjr.org/innovations/virtual_reality_journalism.php\n\nGuest notes\n\nBreaking news in 360:\n\nhttps://www.facebook.com/D8News/videos/1080035972078294/\n\nOutcomes\n\nSome captured immersive experiences of MozFest. Detail here:\n360 photo from Ricoh Theta S, 4ch spatial audio recording (Zoom H2N)\nencoded as still picture + 4ch AAC audio + YouTube MetaDataInjector\nhttps://youtu.be/P_1DZkLDXBM  \n When you move, swipe etc. you will realize especially in the beginning the change of \n soundscape through the movement of my voice. Run through several times. \n    \nAnother example from the presentation session in 360 audio (the picture not as good, it was only taken with iPhone in panorama mode):\n    \n    https://youtu.be/AIDu4dHT-tY\n    \n    \n\nLots of lovely ideas and resources to be turned into a blog post. Detail here:\n    \nLifestyle section - VR Cooking - travel to the hosts kitchen to understand the timings, techniques, have a direct link  to ordering the right ingredients on amazon. History/origin of the recipe - potential for learning and bridging cultural worlds with additional information.\n\nClimbing the O2 dome - By climbing the O2 dome the idea is to mix up AR and VR.\nThe point of this is to give not only a point of view standing on a place and looking around but also offering the movement (forward, backward, ...)as UX. \nThe user can get the experience of moving along the route wearing an head-set device that can show information moving along (data, details on the buildings seen all around, etc..). At the same time there are some spots where a VR environment kicks in by showing - for instance - as the landscape as changed throughout the years.\n\nVR/360 spa, live 360' streaming of sports events with the possibility to switch between views from many different actors, contextual augmented experience of reading books witgh audiobooks, nature documentaries to see how animal actors perceive the environment\n",
    "id": 686,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-how-we-can-use-----video--binaural-au/export/txt",
    "empty": false,
    "character_count": 6091,
    "term_occurrence": {
        "open": 5,
        "libre": 0,
        "innovation": 1,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}