{
    "session_id": 691,
    "title": "From Broken to Brokering: Designing Digital Roadmaps to Connect Dots for Youth in Our Cities",
    "views": 29,
    "total_favs": 22,
    "fav_count": 28,
    "unfav_count": 6,
    "session_notes": 6,
    "space": "Demystify the web",
    "pathway": "The Future of the Web",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-from-broken-to-brokering--designing-d",
    "notes": "From Broken to Brokering: Designing Digital Roadmaps to Connect Dots for Youth in Our Cities\nSat, October 29, Floor 7 - 703, 11:15am-12:15pm\n\nFacilitators:\n\t* Jerelyn Rodriguez, The Knowledge House, jrodriguez@theknowledgehouse.org\n\t* Nohely Perez, The Knowledge House\n\t* Sergio Garcia The Knowledge House\n\t* Sanda Balaban, CITYPathways\n\t* Dixie Ching, Hive Research Lab, NYU: @dixie_nyu\n\nHandy links:\n\t* Digital Roadmap Tool: http://tinyurl.com/drmap2016\n\t* Site input form: http://tinyurl.com/drform2016\n\t* Handout on Brokering: http://bit.ly/2fjEruw\n\t* Presentation: https://docs.google.com/presentation/d/13zBT5cULMY8-sdMnFxpwg0-pc57UEzPA8qUsr_GnnLo/edit?usp=sharing\n\t* Worksheets:\n\t\t* Juice Generator: http://bit.ly/2eVObqw\n\t\t* Broken2Brokering Activity Guide: http://bit.ly/2fjBGcv\n\nAttendees:\n\t* Jerelyn Rodriguez, The Knowledge House, jrodriguez@theknowledgehouse.org\n\t* <Please add your name, org, optional contact info>\n\t* <Please add your name, org, optional contact info>\n\t* <Please add your name, org, optional contact info>\n\nAGENDA\nActivity 1: “Juice Generator”: How do your youth know and navigate your community?\n[See worksheet above]\n\t* How do youth in your community discover opportunities that align to their interests, link to their learning, and can help them “level up” towards a prospective livelihood? List as many (re)sources and strategies as you can.\n\t\t* Why do you feel youth DON’T take advantages of your community’s barriers? What are the barriers?\n\t* What are 10 resources in your city/community you think youth would enjoy but that they’re not currently engaging with? \n \nDebrief/ Discussion of Juice Generator Activity\nYouth hear about opportunities from churches, peers, libraries, educators\nCollege students learn about internships from college advisors (which advantages those who are able to go to college)\nInternet is also useful but oftentimes the opportunities are not local or timing doesn't match\n--> Online platforms that are interesting/promising: City of learning platform; LRNG platform; The Connectory\n\nActivity 2: Overview of CITYExpeditions\nSee presentation: https://docs.google.com/presentation/d/13zBT5cULMY8-sdMnFxpwg0-pc57UEzPA8qUsr_GnnLo/edit?usp=sharing\ndesign principle of program: exposure to expertise\nat the end, they compiled their projects into their portfolio\n\nActivity 3: Broken2Brokering Activity Stations \n[See worksheet above]\nEdge: we have a DiscoverDesign.org competition. it would be helpful to know what opps are related and to link them. there's a difference btw interested in an experience and one in which the young person is good enough and feels ready to compete.\n\nPathway goal: \"High school students from all over the world interested in design\"\n\nEdge: chicago city of learning. points students to these opps.\nHow do we add online resources with a place based component to the map?\nUse students as ambassadors to others\n\nActivity 4: Synthesis and Next Steps\n\t* How do you envision drawing upon brokering and/or developing a digital road map for your youth?  What are 2-3 concrete next steps you can take in the coming month(s)?\n\t\t* This could be a great opportunity for youth from different organizations to network through maps.\n\t\t* In schools managing transitions and offering exciting opportunities\n\t\t* \n\t* Any a-ha moments, about brokering or lack thereof in your context?\n\t\t* Young people need to be be centered in the design of this tool (less so organizations).\n\t\t* Site form should have contact info if possible to encourage collaboration and sharing.\n\t\t* The idea of providing transportation in a fun way (uber vs. the usual bus!)\n\t\t* Blogging as a form of documentation, reference and resource\n\t\t* We need this system to make our current work/partnerships become more visible.\n\n\t* What are some open questions you still have about brokering?\n\t\t* Factors that triggers brokering at community level—what are the motivating factors for youth?\n\t\t* Possible key partnerships with schools\n\t\t* How do we ensure we are building trusting relationships for brokering? (Esp if tech is the mode of communication)\n\n\t* What challenges do you anticipate you’ll have in implementing approaches like this within your context?\n\t\t* Making a compelling case for new sites in text form\n\t\t* Scaling up this to many organizations and centers\n\n",
    "id": 691,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-from-broken-to-brokering--designing-d/export/txt",
    "empty": false,
    "character_count": 4306,
    "term_occurrence": {
        "open": 1,
        "libre": 0,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}