{
    "session_id": 712,
    "title": "Fireplace - Gather around everyone, it's story time!",
    "views": 32,
    "total_favs": 25,
    "fav_count": 25,
    "unfav_count": 0,
    "session_notes": 14,
    "space": "Demystify the web",
    "pathway": "",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-fireplace---gather-around-everyone--i",
    "notes": "==Fireplace - Gather around everyone, it’s story time!==\n\n\n==Attending==\n*Name // //what are you good at // Twitter handle (or email)\n* Alex Wafula // I can snap my wrists // @xelawafs\n@MangoJoash\n\n\n@secretrobotron\n\nAnh Bui // stay silent for too long and freak everyone out when i suddenly start speaking // Anh@the-incredible-machine.com\n\n\nInspired by the Digital Skills Observatory project, a community shows us how creativity and innovation are affected by people’s stories about their relationships with technology and society, and how these stories can fuel movements. Participants get to learn empathy, to become better listeners and to engage with one another making them better story tellers as they adjust to their audience.\n\n1. How do we simplify concepts? Complicated concepts can’t be taught to illiterate / drop out people?\n\t* simplify might not be the correct word to use here. Instead, a focus on empathy \n\n2. How do we measure progress made? Are we improving the average standard of living.\n\t* \n\n3. How do we know we are creating impact? Are we sure these guys are learning anything?\n\t* Plan starting with impact in mind and have all activities be as a result of achieving impact\n\t* Users must own impact instead of us as facilitators/builders. This increases the likelihood of achieving goals in a clear and visible manner\n\t* social impact change [walter too notes]\n\t* if you don't have a good method of measuring impact means you didn't have a good handle of the problem in the first place\n\t* J.chapman@tanzdevtrust.org  @jachapman82 \n",
    "id": 712,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-fireplace---gather-around-everyone--i/export/txt",
    "empty": false,
    "character_count": 1554,
    "term_occurrence": {
        "open": 0,
        "libre": 0,
        "innovation": 1,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}