{
    "session_id": 751,
    "title": "GOSH! A roadmap for open science hardware",
    "views": 24,
    "total_favs": 20,
    "fav_count": 20,
    "unfav_count": 0,
    "session_notes": 6,
    "space": "Open science",
    "pathway": "",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-gosh--a-roadmap-for-open-science-hard",
    "notes": "Welcome to the GOSH roadmapping session!\n\n\n##What is GOSH?\nGOSH 2016 brought together community leaders for the first international and interdisciplinary conference focused on Open Science Hardware at CERN in March 2016. This led to a community manifesto which we now want to translate to an actionable roadmap.\n\n##Things you can do to get involved!\nApply to join GOSH 2017 in Santiago, 22-25 March - applications opening soon!\n\nCheck out openhardware.science & follow us on @GOSHCommunity\nJoin our google group: https://groups.google.com/forum/#!forum/open-science-hardware\n\n##Who is here at MozFest? Please add you name and Twitter handle or some way of contacting you!\n\n\t* Jenny Molloy, @jenny_molloy\n\t* Jan Hohner, @janhohner\n\n## The Manifesto\n\nThe Global Open Science Hardware (GOSH) movement seeks to reduce barriers between diverse creators and users of scientific tools to support the pursuit and growth of knowledge. These are our principles:\n\nGOSH is accessible\n\t* Anyone can create, obtain, study, modify, distribute, use, and share designs of open science hardware projects.\n\t* Tools are open, free (libre), and licensed as such.\n\t* Our documents are understandable and communicative.\n\t* We share rather than act territorially.\n\t* For socioeconomic accessibility, materials are lowest cost and easy to obtain whenever possible.\n\t* Open Science Hardware is maintainable and repairable.\n\t* We follow the beliefs already established by open source software, free software, open science, and open hardware movements.\n\nGOSH makes science better\n\t* Scientific experiments using open hardware are more reproducible, more comparable, and more likely to be replicated.\n\t* Comparing data across sectors, standards, and countries is more likely when using open hardware.\n\t* Reproducibility is a hallmark of good science, and open science hardware allows for greater reproducibility.\n\t* Open science hardware makes more science.\n\t* 1,000 heads are better than 1.\n\nGOSH is ethical\n\t* People have a right to knowledge, and thus a right to the tools to gain that knowledge.\n\t* Users align their technologies with their values by becoming creators.\n\t* The benefits of science should be shared with everyone, and cause no harm.\n\t* Open science hardware is open to everybody, without considerations of scholarly background, country, race, sex, or religion and does not tolerate discrimination on these grounds.\n\t* GOSH is used for peaceful purposes.\n\nGOSH changes the culture of science\n\t* We advocate for open science, which requires open science hardware.\n\t* We move science toward communal, accessible, and collaborative practices, and away from territorial, proprietary, institutional, and individualistic practices.\n\t* We create more options for people to pursue research, both inside existing institutions (academia, NGOs, government, non-profit, start-up, business) and outside institutions altogether.\n\t* We make spaces for science beyond established institutions (e.g. academia and NGOs) so there are more options for research trajectories.\n\t* We broaden the methods of pursuing way we do science, so the ways of knowing from a wide range of people are part of knowledge creation, now and in the future.\n\nGOSH democratizes science\n\t* More people and more types of people can take part in and benefit from science.\n\t* We break silos, both between disciplines and between types of institutions, bridging different domains of knowledge—you don’t have to be a “biologist” to do biology, or have a degree to do research.\n\t* Open science hardware decreases the divide between the global north and south, professionals and amateurs, particularly in low incomes countries.\n\t* Open science hardware puts local knowledge in action and contributes to cognitive justice.\n\t* Open science hardware allows a diversity of values and voices to ask research questions and to make technology.\n\nGOSH has no high priests\n\t* We have community champions, not a central authority.\n\t* We are an active community invested in shared accomplishments.\n\t* We build on each other’s work rather than work in isolation.\n\t* The more, the merrier.\n\nGOSH empowers people\n\t* To pursue research based on their interests.\n\t* To pursue research based on the needs of their communities.\n\t* To conduct research through many forms of support (including financial, personnel, time, material supports)\n\t* To achieve their ideas at low cost.\n\t* To understand how their tools work through borrowing, building, and sharing technology.\n\t* To have technological transparency and public oversight.\n\t* To build a movement.\n\nGOSH has no black boxes\n(”Black boxes” refer to any complex piece of equipment with contents that are mysterious to the user..)\n\n\t* Technologies are open source\n\t* Through borrowing, building, and sharing technology, we understand how our tools work.\n\t* Building GOSH is a form of learning by doing.\n\t* Open Science Hardware increases technological transparency and public oversight.\n\nGOSH is impactful tools\n\t* Technologies are adaptable and therefore can directly address local social and technical needs.\n\t* There is a direct link between what a community of users needs and science hardware because the community of users can access, change, adapt, and use the tools.\n\t* Open science hardware allows users to post knowledge and results early and often, allowing tools to be agile and responsive.\n\t* Open science hardware is designed to scale.\n\nGOSH allows multiple futures for science\n\t* Research can happen in or out of the academy, in or out of the lab, in or out of commercial spaces.\n\t* GOSH changes the norms within established, institutional science where researchers openly share knowledge and technology.\n\t* With GOSH Indigenous/Non-scientist peoples can make research in their native language and adapted to their local context.\n\t* GOSH allows science to happen in places it would not usually happen.\n\t* GOSH aims to make cultural change so these opportunities are intergenerational.\n",
    "id": 751,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-gosh--a-roadmap-for-open-science-hard/export/txt",
    "empty": false,
    "character_count": 5972,
    "term_occurrence": {
        "open": 28,
        "libre": 1,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 33
    }
}