{
    "session_id": 753,
    "title": "Go green with IoT",
    "views": 45,
    "total_favs": 36,
    "fav_count": 39,
    "unfav_count": 3,
    "session_notes": 14,
    "space": "Open science",
    "pathway": "",
    "language": "",
    "etherpad": "https://public.etherpad-mozilla.org/p/mozfest-2016-go-green-with-iot",
    "notes": "Welcome to Etherpad!\n\nThis pad text is synchronized as you type, so that everyone viewing this page sees the same text. This allows you to collaborate seamlessly on documents!\n\nGet involved with Etherpad at http://etherpad.org\n\nGo Green IoT\n\nlabmet\n\nGet Involved with our project!!\n\nImportant URLs:\n    Labmet weather station https://github.com/lab804/labmet-weatherstation (Documentation being re-written)\n    Labmet libraries https://github.com/lab804/labmet-libraries (being translated to english before become available)\n    Labmet Server https://github.com/lab804/labmet-server (for raspberry py and Nginx)\n    Labmet app https://github.com/lab804/labmet-app (Ionic app)\n    Labmet generate ap https://github.com/lab804/generate-ap (server configuration shell script)\n\nhttp://lab804.com.br/\n\nWe're trying to create something using open source for communities to use.\n\nWhat is labmet about?\n\nWe're trying to develop an open source platform. So people can use the libraries on the farms etc.\n\nWe tried to develop things so that people don't need to know anything about agriculture. They just need the data. That's the goal of the software and the platform we're building.\n\nWe're going to show you the source code and the hardware so you can use it.\n\nWe're making everything by hand, we're trying to get people interested in our product. We want someone to get interested in helping us produce it.\n\nOur device collects the raw data eg temperate, relative humidity, time, pressure. The library on the service helps you know what's best practice in agriculture.\n\nWe'd like people to build their own libraries and add them to our software. We're using Python.\n\nWe're using physics calculations to make it easier for people. We're also using measurements that are context specific, eg mm or inches.\n\nWe're also trying to build a service. We don't want people to have to pay millions for it. \n\nWhere did the project come from?\n\nI was an engineer, my family had a farm. We were using a lot of chemicals on the land. I thought that was crazy, but nobody would believe me. They had no data. I wanted to help them care for the environment.\n\nWhy should people use this system in Brazil?\n\nIn my state in Brazil there are only 3 weather stations. It's very expensive to buy. But the information is very useful.\n\nIn Brazil we have many many sources of data. It's hard to decipher the data from so many sources. Sometimes the data is incomplete.\n\nI decided to make my own weather station that a kid could build. What's good is, we can use this data for everybody. It would be better than having an expensive data station.\n\nThe data doesn't have to be so accurate.\n\nAnother problem: extreme complexity. Some people in Brazil can't read. They can't interpret the data, so they stop caring.\n\nThis has lead to waste of water. One water sprayer can use the water enough to hydrate a whole city in one day.\n\nWe're using a lot of poisons because people don't think about the effects.\n\nData tells us: when do I plant the seed? How much water should I use? Do I need to control the illumination? Is it too cold? Finally, what is the affect of all of this stuff?\n\nWhat is the outcome?\n\nEg for potatoes: they need a temperature of 18 to 20 degrees. 500 to 700 mm of water on the site, Leaf area index of 3.5 to 6, short photo period, Night temperature no bigger than 20 degrees.\n\nThis gives strategic knowledge, that helps people make good decisions about what crops to plant. The platform would explain what people need to do.\n\nWithout data we don't know if we're throwing resources away (we must be!)\n\nWe model virtual plants.The models help us understand: potential productivity (mainly due to the genetics of the plant; the obtainable productivity (the amount the plant would product with water etc); productivity (the real productivity, when disease etc is taking into account).\n\nBut is all of this stuff too far away from you?\n\nYou could use this technology to control your kitchen garden. It's healthier. It has an educational quality. \n\nLet's make an experiment to see! [Demo time]\n\nHe shows a micro controller that was made to use LUA. \n\nHe shows the displayed output of the measurements coming from the micro controller. It shows potential productivity. \n\nWe have 3 githubs, one for our libraries, one for our server and one for [didn't hear]\n\nhttps://github.com/lab804\n\nHe talks us through the weather station: https://github.com/lab804/labmet-weatherstation\n\nThe libraries will be available in 1 week, he's currently working on the documentation (it's all in Portuguese.\n\nHe shows us the server: https://github.com/lab804/labmet-server\n\n----------\nQ. Do you have models for all plants?\nA. The UN model(AquaCrop model) is able to forecast the productivity for many agriculturally important cultures. This is the model that was used in our little experiment. The idea is that the labmet-libraries may disclose  as much crop models as possible, such as Agroclin, Epic, etc... We are trying to build an scipy or an sklearn but for the agriculture \n\nQ. How many types of plants can you control at one time?\nA. The data is the same, but the culture is different. We're trying to see if statistics can tell us what is the minimum area that one sensor can control. In a kitchen there's no variability, so you can control lots of things.\n\nQ. How do you take into account other factors, eg a hydroponics system.\nA. The closer to the plant that you get, the conditions are a lower factor in the health of the plant, eg insects are local.\n\nQ. For soil temperature and soil moisture. What area does one sensor serve?\nA. It depends. We try to make sure the sensors are placed close enough together that they are effective.\n\nQ. Is there a feedback loop available to measure the health of the plant.\nA. I was thinking of that.\n\n\nThank You for the person that made all these annotations, this definetively is going to help everybody that weren't able to go to  the session.\n\n\n",
    "id": 753,
    "url": "https://public.etherpad-mozilla.org/p/mozfest-2016-go-green-with-iot/export/txt",
    "empty": true,
    "character_count": 0,
    "term_occurrence": {
        "open": 0,
        "libre": 0,
        "innovation": 0,
        "inclusion": 0,
        "privacy": 0,
        "science": 0
    }
}